; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain blocks)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks-4-0)
    (:domain blocks)
    (:objects
        d b a c - block
    )
    (:init
        (clear c)
        (clear a)
        (clear b)
        (clear d)
        (ontable c)
        (ontable a)
        (ontable b)
        (ontable d)
        (handempty)
    )
    (:goal
        (and (on d c) (on c b) (on b a))
    )
)

; plan
1. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 0 of 3
2. (stack b a)
   deleted: (holding b) (clear a)
   added: (clear b) (handempty) (on b a)
   goals met: 1 of 3
3. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 1 of 3
4. (stack c b)
   deleted: (holding c) (clear b)
   added: (clear c) (handempty) (on c b)
   goals met: 2 of 3
5. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 2 of 3
6. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 3 of 3
